Тест/Тест/src/InformationRegisters/ИндНомер/ИндНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндНомер</name>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наценка</name>
    <type>
      <types>CatalogRef.Коофициенты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>цп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>дн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>п</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АвитоЧастник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоНовыйИндКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКонвеера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.Поддоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляПоиска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаличия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактНаличия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаНаличие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиЕстьВНаличии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЕстьВНаличии</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УбратьИзАвтозагрузкиАвито</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/CommonForms/ДеталиВАвито/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	///+ТатарМА 09.12.2024
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	НоменклатураАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	НоменклатураАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Категории", МассивКатегорийШин);
	НоменклатураАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	НоменклатураАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ОбновитьПоказателиАвтовыгрузки();
	///-ТатарМА 09.12.2024
	
КонецПроцедуры



&НаКлиенте
Процедура НоменклатураАвитоЧасть1ПриАктивизацииСтроки(Элемент)
	
	///+ТатарМА 09.12.2024
	Если Элементы.НоменклатураАвитоЧасть1.ТекущиеДанные <> Неопределено Тогда
		ТекДанные = Элементы.НоменклатураАвитоЧасть1.ТекущиеДанные;
		УстановитьПараметрыЗапросаАвитоЧасть1(ТекДанные.Номенклатура);
	КонецЕсли;
	///-ТатарМА 09.12.2024
	
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураАвитоЧасть1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ТатарМА 09.12.2024
	ТекСтрока = Элементы.НоменклатураАвитоЧасть1.ТекущиеДанные;
	Если Поле = Элементы.НоменклатураАвитоЧасть1Номенклатура Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Номенклатура;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///-ТатарМА 09.12.2024

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПараметрыЗапросаАвитоЧасть1(ТекДанные)
	
	///+ТатарМА 09.12.2024
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Номенклатура", ТекДанные);
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Категории", МассивКатегорийШин);
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	///-ТатарМА 09.12.2024
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказателиАвтовыгрузки()
	
	///+ТатарМА 09.12.2024
	//Показатели карточек товара
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок
		|ПОМЕСТИТЬ ТоварыИзЗаявок
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0)) КАК КоличествоЗаявок,
		|	ИндНомер.индкод.Владелец.Ссылка КАК Номенклатура,
		|	ИндНомер.индкод.Владелец.Код КАК КодНоменклатуры,
		|	ИндНомер.индкод.Владелец.Артикул КАК АртикулНоменклатуры,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИндНомер.индкод) КАК индкод,
		|	ИндНомер.индкод.Владелец.УбратьИзАвтозагрузкиАвито КАК УбратьИзАвтозагрузкиАвито
		|ИЗ
		|	РегистрСведений.ИндНомер КАК ИндНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявок КАК ТоварыИзЗаявок
		|		ПО (ИндНомер.индкод.Владелец = ТоварыИзЗаявок.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
		|		ПО (ИндНомер.индкод = РегистрНакопления1Остатки.индкод)
		|ГДЕ
		|	РегистрНакопления1Остатки.КолвоОстаток > 0
		|	И ИндНомер.АвитоЧастник
		|	И ТоварыИзЗаявок.КоличествоЗаявок > 0
		|	И ИндНомер.индкод.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ИндНомер.Цена > 0
		|	И ИндНомер.ЕстьФото = ИСТИНА
		|	И ИндНомер.Стеллаж <> &Стеллаж
		|	И ВЫБОР
		|		КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
		|			ТОГДА НЕ РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
		|		ИНАЧЕ
		|		НЕ (ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
		|		ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
		|		ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
		|		ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
		|		ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
		|		ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
		|		ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
		|		ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
		|		ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
		|		ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ
		|	И ИндНомер.Поддон <> &Поддон
		|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
		|СГРУППИРОВАТЬ ПО
		|	ИндНомер.индкод.Владелец.Ссылка,
		|	ИндНомер.индкод.Владелец.Код,
		|	ИндНомер.индкод.Владелец.Артикул,
		|	ИндНомер.индкод.Владелец.УбратьИзАвтозагрузкиАвито";
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	Выборка = Запрос.Выполнить().Выгрузить();
	ВсегоКарточекТовара = Выборка.Количество();
	
	ПараметрыОтбораБезУбранных = Новый Структура("УбратьИзАвтозагрузкиАвито", Ложь);
	ВсегоКарточекТовараВФайле = Выборка.НайтиСтроки(ПараметрыОтбораБезУбранных).Количество();
	
	ПараметрыОтбораУбранные = Новый Структура("УбратьИзАвтозагрузкиАвито", Истина);
	УбранныеКарточкиТовара = Выборка.НайтиСтроки(ПараметрыОтбораУбранные).Количество();
	
	//Показатели деталей
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок
		|ПОМЕСТИТЬ ТоварыИзЗаявок
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) КАК КоличествоЗаявок,
		|	ИндНомер.индкод.Владелец.Ссылка КАК Номенклатура,
		|	ИндНомер.индкод КАК индкод,
		|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
		|	РегистрНакопления1Остатки.Склад КАК Склад,
		|	ИндНомер.УбратьИзАвтозагрузкиАвито
		|ИЗ
		|	РегистрСведений.ИндНомер КАК ИндНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявок КАК ТоварыИзЗаявок
		|		ПО (ИндНомер.индкод.Владелец = ТоварыИзЗаявок.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
		|		ПО (ИндНомер.индкод = РегистрНакопления1Остатки.индкод)
		|ГДЕ
		|	РегистрНакопления1Остатки.КолвоОстаток > 0
		|	И ИндНомер.АвитоЧастник
		|	И ТоварыИзЗаявок.КоличествоЗаявок > 0
		|	И ИндНомер.индкод.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ИндНомер.Цена > 0
		|	И ИндНомер.ЕстьФото = ИСТИНА
		|	И ИндНомер.Стеллаж <> &Стеллаж
		|	И ВЫБОР
		|		КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
		|			ТОГДА НЕ РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
		|		ИНАЧЕ
		|		НЕ (ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
		|		ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
		|		ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
		|		ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
		|		ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
		|		ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
		|		ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
		|		ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
		|		ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
		|		ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ
		|	И ИндНомер.Поддон <> &Поддон
		|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения";
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	Выборка = Запрос.Выполнить().Выгрузить();
	ВсегоДеталей = Выборка.Количество();
	
	ПараметрыОтбораБезУбранных = Новый Структура("УбратьИзАвтозагрузкиАвито", Ложь);
	ВсегоДеталейВФайле = Выборка.НайтиСтроки(ПараметрыОтбораБезУбранных).Количество();
	
	ПараметрыОтбораУбранные = Новый Структура("УбратьИзАвтозагрузкиАвито", Истина);
	УбранныеДетали = Выборка.НайтиСтроки(ПараметрыОтбораУбранные).Количество();
	///-ТатарМА 09.12.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказатели(Команда)
	ОбновитьПоказателиАвтовыгрузки();
КонецПроцедуры


#КонецОбласти
